tap "aws/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "modularml/packages"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sambadevi/powerlevel9k"
brew "arduino-cli"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "black"
brew "borgbackup"
brew "btop"
brew "carthage"
brew "certbot"
brew "cfn-lint"
brew "cmake"
brew "cmatrix"
brew "curl"
brew "libtool"
brew "php"
brew "composer"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dotnet"
brew "duckdb"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fio"
brew "fish"
brew "flyway"
brew "fortune"
brew "fzf"
brew "git"
brew "glances"
brew "gnupg"
brew "go"
brew "golines"
brew "graphviz"
brew "helix"
brew "htop"
brew "hugo"
brew "ifstat"
brew "imagemagick"
brew "imagesnap"
brew "jq"
brew "julia"
brew "kind"
brew "kopia"
brew "kubernetes-cli"
brew "lazygit"
brew "lolcat"
brew "lua-language-server"
brew "luarocks"
brew "macvim"
brew "midnight-commander"
brew "neovim"
brew "ninja"
brew "nnn"
brew "nushell"
brew "nvm"
brew "pipx"
brew "pkg-config"
brew "poetry"
brew "postgresql@14"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyright"
brew "python-lsp-server"
brew "pytorch"
brew "rbenv"
brew "rclone"
brew "rdiff-backup"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup-init"
brew "sevenzip"
brew "showkey"
brew "starship"
brew "subversion"
brew "switchaudio-osx"
brew "telnet"
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"
brew "zsh-lovers"
brew "zsh-navigation-tools"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "modularml/packages/modular"
brew "qmk/qmk/qmk"
brew "sambadevi/powerlevel9k/powerlevel9k"
cask "alacritty"
cask "amethyst"
cask "brave-browser"
cask "dbeaver-community"
cask "drawio"
cask "easy-move-plus-resize"
cask "eloston-chromium"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-input"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-powerline-symbols"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro-for-powerline"
cask "freecad"
cask "gimp"
cask "google-cloud-sdk"
cask "grammarly-desktop"
cask "hightop"
cask "inkscape"
cask "kdiff3"
cask "kopiaui"
cask "libreoffice"
cask "macfuse"
cask "mullvad-browser"
cask "obs"
cask "openscad"
cask "orcaslicer"
cask "podman-desktop"
cask "postman"
cask "powershell"
cask "qmk-toolbox"
cask "qownnotes"
cask "sourcetree"
cask "superslicer"
cask "veracrypt"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "warp"
vscode "1yib.rust-bundle"
vscode "almenon.arepl"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bat67.markdown-extension-pack"
vscode "bierner.emojisense"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "csholmq.excel-to-markdown-table"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mdickin.markdown-shortcuts"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.powershell"
vscode "ms-vscode.test-adapter-converter"
vscode "myml.vscode-markdown-plantuml-preview"
vscode "njpwerner.autodocstring"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "telesoho.vscode-markdown-paste-image"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zaaack.markdown-editor"
vscode "zainchen.json"
